config/Catalogs/ГрафикиИнкассации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГрафикиИнкассации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПонедельникАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторникАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредаАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧетвергАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПятницаАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубботаАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВоскресеньеАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПонедельникВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторникВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧетвергВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПятницаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубботаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВоскресеньеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/ГрафикиИнкассации/Ext/ObjectModule.bsl
Функция СгенерироватьНаименование() Экспорт
	
	СтрокаНаименования = 
	?(ПонедельникАктивность, 	"пн - " + Формат(ПонедельникВремя, 	"ДФ=HH:mm; ДП=00:00") + "; ", "") 
	+ ?(ВторникАктивность, 		"вт - " + Формат(ВторникВремя, 		"ДФ=HH:mm; ДП=00:00") + "; ", "")
	+ ?(СредаАктивность, 		"ср - " + Формат(СредаВремя, 		"ДФ=HH:mm; ДП=00:00") + "; ", "")
	+ ?(ЧетвергАктивность, 		"чт - " + Формат(ЧетвергВремя, 		"ДФ=HH:mm; ДП=00:00") + "; ", "")
	+ ?(ПятницаАктивность, 		"пт - " + Формат(ПятницаВремя, 		"ДФ=HH:mm; ДП=00:00") + "; ", "")
	+ ?(СубботаАктивность, 		"сб - " + Формат(СубботаВремя, 		"ДФ=HH:mm; ДП=00:00") + "; ", "")
	+ ?(ВоскресеньеАктивность, 	"вс - " + Формат(ВоскресеньеВремя, 	"ДФ=HH:mm; ДП=00:00") + "; ", "");
	
	Если ЗначениеЗаполнено(СтрокаНаименования) Тогда
		Возврат Сред(СтрокаНаименования, 1, СтрДлина(СтрокаНаименования)-2);
	Иначе
		Возврат "<График не задан>";
	КонецЕсли;
	
КонецФункции
